[
  {
    "title": "Engenheiro de Software Sênior",
    "company": "Mercado Livre",
    "period": "Setembro 2021 - Presente",
    "description": "Engenheiro de software líder responsável pelo desenvolvimento e manutenção de toolkits e bibliotecas essenciais para serviços backend.",
    "achievements": [
      "Liderou o desenvolvimento de toolkits e bibliotecas melhorando a eficiência dos serviços backend",
      "Aprimorou o sistema de restrições logísticas usando Go",
      "Construiu algoritmo de machine learning para previsão de elegibilidade de transporte aéreo",
      "Liderou projetos significativos incluindo transferência Flyability e nova arquitetura para restrições",
      "Mentorou membros da equipe e participou de projetos inner-sourcing",
      "Colaborou com equipes de engenharia para alinhar melhores práticas e padrões"
    ]
  },
  {
    "title": "Engenheiro de Software Sênior",
    "company": "Varsity Tutors",
    "period": "Maio 2024 - Novembro 2024",
    "description": "Engenheiro sênior focado em fluxos de dados empresariais e melhorias de estabilidade do sistema.",
    "achievements": [
      "Desenvolveu integração de dados HubSpot com AWS Redshift usando Golang",
      "Desenvolveu bibliotecas utilitárias para acelerar refatoração de código",
      "Construiu sistema de autenticação baseado em SSO",
      "Resolveu problemas críticos de produção e implementou novos recursos"
    ]
  },
  {
    "title": "Professor",
    "company": "UniCEUB",
    "period": "Julho 2022 - Julho 2024",
    "description": "Professor de lógica introdutória e cursos de programação web.",
    "achievements": [
      "Ministrou cursos de programação para alunos do 1º e 4º semestres",
      "Desenvolveu e administrou avaliações do curso",
      "Forneceu suporte abrangente aos alunos",
      "Equilibrou aspectos teóricos e práticos da educação em programação"
    ]
  },
  {
    "title": "Engenheiro de Software",
    "company": "Lantern",
    "period": "Setembro 2021 - Setembro 2022",
    "description": "Liderou o desenvolvimento do projeto de carteira de criptomoedas Yinbi.",
    "achievements": [
      "Liderou o desenvolvimento frontend da carteira de criptomoedas Yinbi",
      "Liderou o desenvolvimento MVP e execução do ciclo completo",
      "Integrou múltiplos provedores de criptomoedas para transações de ativos digitais",
      "Melhorou a qualidade do código em vários repositórios"
    ]
  },
  {
    "title": "Arquiteto de Software",
    "company": "GigaCandanga",
    "period": "Fevereiro 2021 - Setembro 2021",
    "description": "Liderou o desenvolvimento de um sistema ERP robusto usando tecnologias modernas.",
    "achievements": [
      "Desenvolveu ERP usando Golang, React, TypeScript, PostgreSQL e Webdav",
      "Responsável pela arquitetura de microsserviços",
      "Implementou POCs e gerenciou infraestrutura",
      "Gerenciou CI/CD e infraestrutura de servidores on-premises",
      "Liderou revisões de código e forneceu sessões de transferência de conhecimento"
    ]
  },
  {
    "title": "Desenvolvedor Analista",
    "company": "Ambev Tech",
    "period": "Outubro 2020 - Setembro 2021",
    "description": "Desenvolvimento de soluções e-commerce escaláveis usando tecnologias web modernas.",
    "achievements": [
      "Desenvolveu e-commerce robusto usando React, TypeScript e RecoilJS",
      "Implementou pipelines de CI/CD frontend no Azure DevOps",
      "Mentorou desenvolvedores júnior e conduziu entrevistas técnicas",
      "Desenvolveu novos recursos usando NextJS e Redux",
      "Implementou testes end-to-end usando Cypress"
    ]
  },
  {
    "title": "Desenvolvedor Full-stack",
    "company": "Citara Labs",
    "period": "Agosto 2019 - Abril 2020",
    "description": "Desenvolvimento de aplicações IoT multiprotocolo usando várias tecnologias.",
    "achievements": [
      "Desenvolveu aplicação IoT usando React, TypeScript, Python, Golang, GraphQL e Cassandra",
      "Responsável pela qualidade do código frontend e backend",
      "Forneceu liderança técnica para novos membros da equipe",
      "Participou de refinamentos de funcionalidades"
    ]
  },
  {
    "title": "Desenvolvedor de Software",
    "company": "Mirante",
    "period": "Janeiro 2018 - Julho 2019",
    "description": "Desenvolvimento de soluções empresariais usando tecnologias Java.",
    "achievements": [
      "Construiu um ERP usando Java Spring e Wicket para uma empresa de turismo",
      "Desenvolveu novos recursos e manteve código legado",
      "Ajudou outros estagiários com suas atividades"
    ]
  }
] 